Revit 2027 API
ParameterTypeId.ViewCameraOrientation Property
 "Locked Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewCameraOrientation { get; }
Public Shared ReadOnly Property ViewCameraOrientation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewCameraOrientation {
	ForgeTypeId^ get ();
}
static member ViewCameraOrientation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace